Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedAreaLoad Methods
The AnalysisDecomposedAreaLoad type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis decomposed area load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisDecomposedAreaLoad Class
Tekla.Structures.Analysis Namespace